package com.dtstep.lighthouse.test.local;

import com.dtstep.lighthouse.client.SelectedConverter;
import com.dtstep.lighthouse.common.entity.components.SelectedElement;
import com.dtstep.lighthouse.common.util.JsonUtil;
import com.fasterxml.jackson.databind.JsonNode;
import com.fasterxml.jackson.databind.node.ArrayNode;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Objects;
import java.util.concurrent.ThreadLocalRandom;

public class LocalUtil {

    private static String data = "[\n" +
            "  {\n" +
            "    \"code\": \"110000\",\n" +
            "    \"region\": \"北京市\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"110100\",\n" +
            "        \"region\": \"朝阳区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"110200\",\n" +
            "        \"region\": \"海淀区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"110300\",\n" +
            "        \"region\": \"东城区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"110400\",\n" +
            "        \"region\": \"西城区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"110500\",\n" +
            "        \"region\": \"昌平区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"110600\",\n" +
            "        \"region\": \"通州区\"       \n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"120000\",\n" +
            "    \"region\": \"天津市\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"120100\",\n" +
            "        \"region\": \"和平区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"120200\",\n" +
            "        \"region\": \"河东区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"120300\",\n" +
            "        \"region\": \"南开区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"120400\",\n" +
            "        \"region\": \"滨海新区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"120500\",\n" +
            "        \"region\": \"武清区\"       \n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"130000\",\n" +
            "    \"region\": \"河北省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"130100\",\n" +
            "        \"region\": \"石家庄市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"130200\",\n" +
            "        \"region\": \"唐山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"130300\",\n" +
            "        \"region\": \"秦皇岛市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"130400\",\n" +
            "        \"region\": \"邯郸市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"130500\",\n" +
            "        \"region\": \"邢台市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"130600\",\n" +
            "        \"region\": \"保定市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"130700\",\n" +
            "        \"region\": \"张家口市\"\n" +
            "        \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"130800\",\n" +
            "        \"region\": \"承德市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"130900\",\n" +
            "        \"region\": \"沧州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"131000\",\n" +
            "        \"region\": \"廊坊市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"131100\",\n" +
            "        \"region\": \"衡水市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"139000\",\n" +
            "        \"region\": \"省直辖县级行政区划\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"140000\",\n" +
            "    \"region\": \"山西省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"140100\",\n" +
            "        \"region\": \"太原市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"140200\",\n" +
            "        \"region\": \"大同市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"140300\",\n" +
            "        \"region\": \"阳泉市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"140400\",\n" +
            "        \"region\": \"长治市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"140500\",\n" +
            "        \"region\": \"晋城市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"140600\",\n" +
            "        \"region\": \"朔州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"140700\",\n" +
            "        \"region\": \"晋中市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"140800\",\n" +
            "        \"region\": \"运城市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"140900\",\n" +
            "        \"region\": \"忻州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"141000\",\n" +
            "        \"region\": \"临汾市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"141100\",\n" +
            "        \"region\": \"吕梁市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"150000\",\n" +
            "    \"region\": \"内蒙古自治区\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"150100\",\n" +
            "        \"region\": \"呼和浩特市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"150200\",\n" +
            "        \"region\": \"包头市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"150300\",\n" +
            "        \"region\": \"乌海市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"150400\",\n" +
            "        \"region\": \"赤峰市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"150500\",\n" +
            "        \"region\": \"通辽市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"150600\",\n" +
            "        \"region\": \"鄂尔多斯市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"150700\",\n" +
            "        \"region\": \"呼伦贝尔市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"150800\",\n" +
            "        \"region\": \"巴彦淖尔市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"150900\",\n" +
            "        \"region\": \"乌兰察布市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"152200\",\n" +
            "        \"region\": \"兴安盟\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"152500\",\n" +
            "        \"region\": \"锡林郭勒盟\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"152900\",\n" +
            "        \"region\": \"阿拉善盟\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"210000\",\n" +
            "    \"region\": \"辽宁省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"210100\",\n" +
            "        \"region\": \"沈阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"210200\",\n" +
            "        \"region\": \"大连市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"210300\",\n" +
            "        \"region\": \"鞍山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"210400\",\n" +
            "        \"region\": \"抚顺市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"210500\",\n" +
            "        \"region\": \"本溪市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"210600\",\n" +
            "        \"region\": \"丹东市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"210700\",\n" +
            "        \"region\": \"锦州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"210800\",\n" +
            "        \"region\": \"营口市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"210900\",\n" +
            "        \"region\": \"阜新市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"211000\",\n" +
            "        \"region\": \"辽阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"211100\",\n" +
            "        \"region\": \"盘锦市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"211200\",\n" +
            "        \"region\": \"铁岭市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"211300\",\n" +
            "        \"region\": \"朝阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"211400\",\n" +
            "        \"region\": \"葫芦岛市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"220000\",\n" +
            "    \"region\": \"吉林省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"220100\",\n" +
            "        \"region\": \"长春市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"220200\",\n" +
            "        \"region\": \"吉林市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"220300\",\n" +
            "        \"region\": \"四平市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"220400\",\n" +
            "        \"region\": \"辽源市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"220500\",\n" +
            "        \"region\": \"通化市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"220600\",\n" +
            "        \"region\": \"白山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"220700\",\n" +
            "        \"region\": \"松原市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"220800\",\n" +
            "        \"region\": \"白城市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"222400\",\n" +
            "        \"region\": \"延边朝鲜族自治州\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"230000\",\n" +
            "    \"region\": \"黑龙江省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"230100\",\n" +
            "        \"region\": \"哈尔滨市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"230200\",\n" +
            "        \"region\": \"齐齐哈尔市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"230300\",\n" +
            "        \"region\": \"鸡西市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"230400\",\n" +
            "        \"region\": \"鹤岗市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"230500\",\n" +
            "        \"region\": \"双鸭山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"230600\",\n" +
            "        \"region\": \"大庆市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"230700\",\n" +
            "        \"region\": \"伊春市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"230800\",\n" +
            "        \"region\": \"佳木斯市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"230900\",\n" +
            "        \"region\": \"七台河市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"231000\",\n" +
            "        \"region\": \"牡丹江市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"231100\",\n" +
            "        \"region\": \"黑河市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"231200\",\n" +
            "        \"region\": \"绥化市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"232700\",\n" +
            "        \"region\": \"大兴安岭地区\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"310000\",\n" +
            "    \"region\": \"上海市\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"310100\",\n" +
            "        \"region\": \"黄浦区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"310200\",\n" +
            "        \"region\": \"徐汇区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"310300\",\n" +
            "        \"region\": \"静安区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"31400\",\n" +
            "        \"region\": \"虹口区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"310500\",\n" +
            "        \"region\": \"浦东区\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"310600\",\n" +
            "        \"region\": \"崇明区\"       \n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"320000\",\n" +
            "    \"region\": \"江苏省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"320100\",\n" +
            "        \"region\": \"南京市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"320200\",\n" +
            "        \"region\": \"无锡市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"320300\",\n" +
            "        \"region\": \"徐州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"320400\",\n" +
            "        \"region\": \"常州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"320500\",\n" +
            "        \"region\": \"苏州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"320600\",\n" +
            "        \"region\": \"南通市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"320700\",\n" +
            "        \"region\": \"连云港市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"320800\",\n" +
            "        \"region\": \"淮安市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"320900\",\n" +
            "        \"region\": \"盐城市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"321000\",\n" +
            "        \"region\": \"扬州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"321100\",\n" +
            "        \"region\": \"镇江市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"321200\",\n" +
            "        \"region\": \"泰州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"321300\",\n" +
            "        \"region\": \"宿迁市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"330000\",\n" +
            "    \"region\": \"浙江省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"330100\",\n" +
            "        \"region\": \"杭州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"330200\",\n" +
            "        \"region\": \"宁波市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"330300\",\n" +
            "        \"region\": \"温州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"330400\",\n" +
            "        \"region\": \"嘉兴市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"330500\",\n" +
            "        \"region\": \"湖州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"330600\",\n" +
            "        \"region\": \"绍兴市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"330700\",\n" +
            "        \"region\": \"金华市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"330800\",\n" +
            "        \"region\": \"衢州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"330900\",\n" +
            "        \"region\": \"舟山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"331000\",\n" +
            "        \"region\": \"台州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"331100\",\n" +
            "        \"region\": \"丽水市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"340000\",\n" +
            "    \"region\": \"安徽省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"340100\",\n" +
            "        \"region\": \"合肥市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"340200\",\n" +
            "        \"region\": \"芜湖市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"340300\",\n" +
            "        \"region\": \"蚌埠市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"340400\",\n" +
            "        \"region\": \"淮南市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"340500\",\n" +
            "        \"region\": \"马鞍山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"340600\",\n" +
            "        \"region\": \"淮北市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"340700\",\n" +
            "        \"region\": \"铜陵市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"340800\",\n" +
            "        \"region\": \"安庆市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"341000\",\n" +
            "        \"region\": \"黄山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"341100\",\n" +
            "        \"region\": \"滁州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"341200\",\n" +
            "        \"region\": \"阜阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"341300\",\n" +
            "        \"region\": \"宿州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"341500\",\n" +
            "        \"region\": \"六安市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"341600\",\n" +
            "        \"region\": \"亳州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"341700\",\n" +
            "        \"region\": \"池州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"341800\",\n" +
            "        \"region\": \"宣城市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"350000\",\n" +
            "    \"region\": \"福建省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"350100\",\n" +
            "        \"region\": \"福州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"350200\",\n" +
            "        \"region\": \"厦门市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"350300\",\n" +
            "        \"region\": \"莆田市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"350400\",\n" +
            "        \"region\": \"三明市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"350500\",\n" +
            "        \"region\": \"泉州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"350600\",\n" +
            "        \"region\": \"漳州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"350700\",\n" +
            "        \"region\": \"南平市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"350800\",\n" +
            "        \"region\": \"龙岩市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"350900\",\n" +
            "        \"region\": \"宁德市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"360000\",\n" +
            "    \"region\": \"江西省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"360100\",\n" +
            "        \"region\": \"南昌市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"360200\",\n" +
            "        \"region\": \"景德镇市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"360300\",\n" +
            "        \"region\": \"萍乡市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"360400\",\n" +
            "        \"region\": \"九江市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"360500\",\n" +
            "        \"region\": \"新余市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"360600\",\n" +
            "        \"region\": \"鹰潭市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"360700\",\n" +
            "        \"region\": \"赣州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"360800\",\n" +
            "        \"region\": \"吉安市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"360900\",\n" +
            "        \"region\": \"宜春市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"361000\",\n" +
            "        \"region\": \"抚州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"361100\",\n" +
            "        \"region\": \"上饶市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"370000\",\n" +
            "    \"region\": \"山东省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"370100\",\n" +
            "        \"region\": \"济南市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"370200\",\n" +
            "        \"region\": \"青岛市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"370300\",\n" +
            "        \"region\": \"淄博市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"370400\",\n" +
            "        \"region\": \"枣庄市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"370500\",\n" +
            "        \"region\": \"东营市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"370600\",\n" +
            "        \"region\": \"烟台市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"370700\",\n" +
            "        \"region\": \"潍坊市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"370800\",\n" +
            "        \"region\": \"济宁市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"370900\",\n" +
            "        \"region\": \"泰安市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"371000\",\n" +
            "        \"region\": \"威海市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"371100\",\n" +
            "        \"region\": \"日照市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"371200\",\n" +
            "        \"region\": \"莱芜市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"371300\",\n" +
            "        \"region\": \"临沂市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"371400\",\n" +
            "        \"region\": \"德州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"371500\",\n" +
            "        \"region\": \"聊城市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"371600\",\n" +
            "        \"region\": \"滨州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"371700\",\n" +
            "        \"region\": \"菏泽市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"410000\",\n" +
            "    \"region\": \"河南省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"410100\",\n" +
            "        \"region\": \"郑州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"410200\",\n" +
            "        \"region\": \"开封市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"410300\",\n" +
            "        \"region\": \"洛阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"410400\",\n" +
            "        \"region\": \"平顶山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"410500\",\n" +
            "        \"region\": \"安阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"410600\",\n" +
            "        \"region\": \"鹤壁市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"410700\",\n" +
            "        \"region\": \"新乡市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"410800\",\n" +
            "        \"region\": \"焦作市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"410900\",\n" +
            "        \"region\": \"濮阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"411000\",\n" +
            "        \"region\": \"许昌市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"411100\",\n" +
            "        \"region\": \"漯河市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"411200\",\n" +
            "        \"region\": \"三门峡市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"411300\",\n" +
            "        \"region\": \"南阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"411400\",\n" +
            "        \"region\": \"商丘市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"411500\",\n" +
            "        \"region\": \"信阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"411600\",\n" +
            "        \"region\": \"周口市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"411700\",\n" +
            "        \"region\": \"驻马店市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"419000\",\n" +
            "        \"region\": \"省直辖县级行政区划\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"420000\",\n" +
            "    \"region\": \"湖北省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"420100\",\n" +
            "        \"region\": \"武汉市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"420200\",\n" +
            "        \"region\": \"黄石市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"420300\",\n" +
            "        \"region\": \"十堰市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"420500\",\n" +
            "        \"region\": \"宜昌市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"420600\",\n" +
            "        \"region\": \"襄阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"420700\",\n" +
            "        \"region\": \"鄂州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"420800\",\n" +
            "        \"region\": \"荆门市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"420900\",\n" +
            "        \"region\": \"孝感市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"421000\",\n" +
            "        \"region\": \"荆州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"421100\",\n" +
            "        \"region\": \"黄冈市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"421200\",\n" +
            "        \"region\": \"咸宁市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"421300\",\n" +
            "        \"region\": \"随州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"422800\",\n" +
            "        \"region\": \"恩施土家族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"429000\",\n" +
            "        \"region\": \"省直辖县级行政区划\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"429004\",\n" +
            "        \"region\": \"仙桃市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"429005\",\n" +
            "        \"region\": \"潜江市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"429006\",\n" +
            "        \"region\": \"天门市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"429021\",\n" +
            "        \"region\": \"神农架林区\"\n" +
            "      }\t  \n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"430000\",\n" +
            "    \"region\": \"湖南省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"430100\",\n" +
            "        \"region\": \"长沙市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"430200\",\n" +
            "        \"region\": \"株洲市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"430300\",\n" +
            "        \"region\": \"湘潭市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"430400\",\n" +
            "        \"region\": \"衡阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"430500\",\n" +
            "        \"region\": \"邵阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"430600\",\n" +
            "        \"region\": \"岳阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"430700\",\n" +
            "        \"region\": \"常德市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"430800\",\n" +
            "        \"region\": \"张家界市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"430900\",\n" +
            "        \"region\": \"益阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"431000\",\n" +
            "        \"region\": \"郴州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"431100\",\n" +
            "        \"region\": \"永州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"431200\",\n" +
            "        \"region\": \"怀化市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"431300\",\n" +
            "        \"region\": \"娄底市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"433100\",\n" +
            "        \"region\": \"湘西土家族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469001\",\n" +
            "        \"region\": \"五指山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469002\",\n" +
            "        \"region\": \"琼海市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469005\",\n" +
            "        \"region\": \"文昌市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469006\",\n" +
            "        \"region\": \"万宁市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469007\",\n" +
            "        \"region\": \"东方市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469021\",\n" +
            "        \"region\": \"定安县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469022\",\n" +
            "        \"region\": \"屯昌县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469023\",\n" +
            "        \"region\": \"澄迈县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469024\",\n" +
            "        \"region\": \"临高县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469025\",\n" +
            "        \"region\": \"白沙黎族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469026\",\n" +
            "        \"region\": \"昌江黎族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469027\",\n" +
            "        \"region\": \"乐东黎族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469028\",\n" +
            "        \"region\": \"陵水黎族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469029\",\n" +
            "        \"region\": \"保亭黎族苗族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469030\",\n" +
            "        \"region\": \"琼中黎族苗族自治县\"\n" +
            "      }\t\t\t\t\t\t\t\t\t\t\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"440000\",\n" +
            "    \"region\": \"广东省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"440100\",\n" +
            "        \"region\": \"广州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"440200\",\n" +
            "        \"region\": \"韶关市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"440300\",\n" +
            "        \"region\": \"深圳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"440400\",\n" +
            "        \"region\": \"珠海市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"440500\",\n" +
            "        \"region\": \"汕头市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"440600\",\n" +
            "        \"region\": \"佛山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"440700\",\n" +
            "        \"region\": \"江门市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"440800\",\n" +
            "        \"region\": \"湛江市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"440900\",\n" +
            "        \"region\": \"茂名市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"441200\",\n" +
            "        \"region\": \"肇庆市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"441300\",\n" +
            "        \"region\": \"惠州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"441400\",\n" +
            "        \"region\": \"梅州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"441500\",\n" +
            "        \"region\": \"汕尾市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"441600\",\n" +
            "        \"region\": \"河源市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"441700\",\n" +
            "        \"region\": \"阳江市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"441800\",\n" +
            "        \"region\": \"清远市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"441900\",\n" +
            "        \"region\": \"东莞市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"442000\",\n" +
            "        \"region\": \"中山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"445100\",\n" +
            "        \"region\": \"潮州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"445200\",\n" +
            "        \"region\": \"揭阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"445300\",\n" +
            "        \"region\": \"云浮市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"450000\",\n" +
            "    \"region\": \"广西壮族自治区\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"450100\",\n" +
            "        \"region\": \"南宁市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"450200\",\n" +
            "        \"region\": \"柳州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"450300\",\n" +
            "        \"region\": \"桂林市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"450400\",\n" +
            "        \"region\": \"梧州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"450500\",\n" +
            "        \"region\": \"北海市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"450600\",\n" +
            "        \"region\": \"防城港市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"450700\",\n" +
            "        \"region\": \"钦州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"450800\",\n" +
            "        \"region\": \"贵港市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"450900\",\n" +
            "        \"region\": \"玉林市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"451000\",\n" +
            "        \"region\": \"百色市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"451100\",\n" +
            "        \"region\": \"贺州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"451200\",\n" +
            "        \"region\": \"河池市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"451300\",\n" +
            "        \"region\": \"来宾市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"451400\",\n" +
            "        \"region\": \"崇左市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"460000\",\n" +
            "    \"region\": \"海南省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"460100\",\n" +
            "        \"region\": \"海口市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"460200\",\n" +
            "        \"region\": \"三亚市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"460300\",\n" +
            "        \"region\": \"三沙市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"460400\",\n" +
            "        \"region\": \"儋州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"469000\",\n" +
            "        \"region\": \"省直辖县级行政区划\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"500000\",\n" +
            "    \"region\": \"重庆市\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"500100\",\n" +
            "        \"region\": \"渝中区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"500200\",\n" +
            "        \"region\": \"江北区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"500300\",\n" +
            "        \"region\": \"南岸区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"500400\",\n" +
            "        \"region\": \"巴南区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"500500\",\n" +
            "        \"region\": \"铜梁区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"500600\",\n" +
            "        \"region\": \"南岸区\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"510000\",\n" +
            "    \"region\": \"四川省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"510100\",\n" +
            "        \"region\": \"成都市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"510300\",\n" +
            "        \"region\": \"自贡市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"510400\",\n" +
            "        \"region\": \"攀枝花市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"510500\",\n" +
            "        \"region\": \"泸州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"510600\",\n" +
            "        \"region\": \"德阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"510700\",\n" +
            "        \"region\": \"绵阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"510800\",\n" +
            "        \"region\": \"广元市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"510900\",\n" +
            "        \"region\": \"遂宁市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511000\",\n" +
            "        \"region\": \"内江市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511100\",\n" +
            "        \"region\": \"乐山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511300\",\n" +
            "        \"region\": \"南充市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511400\",\n" +
            "        \"region\": \"眉山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511500\",\n" +
            "        \"region\": \"宜宾市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511600\",\n" +
            "        \"region\": \"广安市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511700\",\n" +
            "        \"region\": \"达州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511800\",\n" +
            "        \"region\": \"雅安市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"511900\",\n" +
            "        \"region\": \"巴中市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"512000\",\n" +
            "        \"region\": \"资阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"513200\",\n" +
            "        \"region\": \"阿坝藏族羌族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"513300\",\n" +
            "        \"region\": \"甘孜藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"513400\",\n" +
            "        \"region\": \"凉山彝族自治州\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"520000\",\n" +
            "    \"region\": \"贵州省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"520100\",\n" +
            "        \"region\": \"贵阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"520200\",\n" +
            "        \"region\": \"六盘水市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"520300\",\n" +
            "        \"region\": \"遵义市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"520400\",\n" +
            "        \"region\": \"安顺市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"520500\",\n" +
            "        \"region\": \"毕节市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"520600\",\n" +
            "        \"region\": \"铜仁市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"522300\",\n" +
            "        \"region\": \"黔西南布依族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"522600\",\n" +
            "        \"region\": \"黔东南苗族侗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"522700\",\n" +
            "        \"region\": \"黔南布依族苗族自治州\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"530000\",\n" +
            "    \"region\": \"云南省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"530100\",\n" +
            "        \"region\": \"昆明市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"530300\",\n" +
            "        \"region\": \"曲靖市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"530400\",\n" +
            "        \"region\": \"玉溪市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"530500\",\n" +
            "        \"region\": \"保山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"530600\",\n" +
            "        \"region\": \"昭通市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"530700\",\n" +
            "        \"region\": \"丽江市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"530800\",\n" +
            "        \"region\": \"普洱市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"530900\",\n" +
            "        \"region\": \"临沧市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"532300\",\n" +
            "        \"region\": \"楚雄彝族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"532500\",\n" +
            "        \"region\": \"红河哈尼族彝族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"532600\",\n" +
            "        \"region\": \"文山壮族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"532800\",\n" +
            "        \"region\": \"西双版纳傣族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"532900\",\n" +
            "        \"region\": \"大理白族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"533100\",\n" +
            "        \"region\": \"德宏傣族景颇族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"533300\",\n" +
            "        \"region\": \"怒江傈僳族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"533400\",\n" +
            "        \"region\": \"迪庆藏族自治州\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"540000\",\n" +
            "    \"region\": \"西藏自治区\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"540100\",\n" +
            "        \"region\": \"拉萨市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"540200\",\n" +
            "        \"region\": \"日喀则市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"540300\",\n" +
            "        \"region\": \"昌都市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"540400\",\n" +
            "        \"region\": \"林芝市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"540500\",\n" +
            "        \"region\": \"山南市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"542400\",\n" +
            "        \"region\": \"那曲地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"542500\",\n" +
            "        \"region\": \"阿里地区\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"610000\",\n" +
            "    \"region\": \"陕西省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"610100\",\n" +
            "        \"region\": \"西安市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"610200\",\n" +
            "        \"region\": \"铜川市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"610300\",\n" +
            "        \"region\": \"宝鸡市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"610400\",\n" +
            "        \"region\": \"咸阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"610500\",\n" +
            "        \"region\": \"渭南市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"610600\",\n" +
            "        \"region\": \"延安市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"610700\",\n" +
            "        \"region\": \"汉中市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"610800\",\n" +
            "        \"region\": \"榆林市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"610900\",\n" +
            "        \"region\": \"安康市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"611000\",\n" +
            "        \"region\": \"商洛市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"620000\",\n" +
            "    \"region\": \"甘肃省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"620100\",\n" +
            "        \"region\": \"兰州市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"620200\",\n" +
            "        \"region\": \"嘉峪关市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"620300\",\n" +
            "        \"region\": \"金昌市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"620400\",\n" +
            "        \"region\": \"白银市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"620500\",\n" +
            "        \"region\": \"天水市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"620600\",\n" +
            "        \"region\": \"武威市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"620700\",\n" +
            "        \"region\": \"张掖市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"620800\",\n" +
            "        \"region\": \"平凉市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"620900\",\n" +
            "        \"region\": \"酒泉市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"621000\",\n" +
            "        \"region\": \"庆阳市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"621100\",\n" +
            "        \"region\": \"定西市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"621200\",\n" +
            "        \"region\": \"陇南市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"622900\",\n" +
            "        \"region\": \"临夏回族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"623000\",\n" +
            "        \"region\": \"甘南藏族自治州\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"630000\",\n" +
            "    \"region\": \"青海省\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"630100\",\n" +
            "        \"region\": \"西宁市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"630200\",\n" +
            "        \"region\": \"海东市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"632200\",\n" +
            "        \"region\": \"海北藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"632300\",\n" +
            "        \"region\": \"黄南藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"632500\",\n" +
            "        \"region\": \"海南藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"632600\",\n" +
            "        \"region\": \"果洛藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"632700\",\n" +
            "        \"region\": \"玉树藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"632800\",\n" +
            "        \"region\": \"海西蒙古族藏族自治州\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"640000\",\n" +
            "    \"region\": \"宁夏回族自治区\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"640100\",\n" +
            "        \"region\": \"银川市\"       \n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"640200\",\n" +
            "        \"region\": \"石嘴山市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"640300\",\n" +
            "        \"region\": \"吴忠市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"640400\",\n" +
            "        \"region\": \"固原市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"640500\",\n" +
            "        \"region\": \"中卫市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"650000\",\n" +
            "    \"region\": \"新疆维吾尔自治区\",\n" +
            "    \"regionEntitys\": [\n" +
            "      {\n" +
            "        \"code\": \"650100\",\n" +
            "        \"region\": \"乌鲁木齐市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"650200\",\n" +
            "        \"region\": \"克拉玛依市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"650400\",\n" +
            "        \"region\": \"吐鲁番市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"650500\",\n" +
            "        \"region\": \"哈密市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"652300\",\n" +
            "        \"region\": \"昌吉回族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"652700\",\n" +
            "        \"region\": \"博尔塔拉蒙古自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"652800\",\n" +
            "        \"region\": \"巴音郭楞蒙古自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"652900\",\n" +
            "        \"region\": \"阿克苏地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"653000\",\n" +
            "        \"region\": \"克孜勒苏柯尔克孜自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"653100\",\n" +
            "        \"region\": \"喀什地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"653200\",\n" +
            "        \"region\": \"和田地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"654000\",\n" +
            "        \"region\": \"伊犁哈萨克自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"654200\",\n" +
            "        \"region\": \"塔城地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"654300\",\n" +
            "        \"region\": \"阿勒泰地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"659000\",\n" +
            "        \"region\": \"自治区直辖县级行政区划\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"659001\",\n" +
            "        \"region\": \"石河子市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"659002\",\n" +
            "        \"region\": \"阿拉尔市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"659003\",\n" +
            "        \"region\": \"图木舒克市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"659004\",\n" +
            "        \"region\": \"五家渠市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"code\": \"659006\",\n" +
            "        \"region\": \"铁门关市\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"710000\",\n" +
            "    \"region\": \"台湾省\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"810000\",\n" +
            "    \"region\": \"香港特别行政区\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"code\": \"820000\",\n" +
            "    \"region\": \"澳门特别行政区\"\n" +
            "  }\n" +
            "]";

    private static final List<LocalEntity> provinceList = new ArrayList<>();

    private static final List<LocalEntity> cityList = new ArrayList<>();

    private static final HashMap<String,LocalEntity> localMap = new HashMap<>();

    static {
        try{
            JsonNode jsonNode = JsonUtil.readTree(data);
            ArrayNode arrayNode = (ArrayNode) jsonNode;
            for(int i = 0; i< Objects.requireNonNull(arrayNode).size(); i++){
                JsonNode provinceNode = arrayNode.get(i);
                String id = provinceNode.get("code").asText();
                String name = provinceNode.get("region").asText();
                LocalEntity provinceEntity = new LocalEntity();
                provinceEntity.setId(id);
                provinceEntity.setName(name);
                provinceEntity.setLevel(1);
                provinceEntity.setPid("-1");
                provinceList.add(provinceEntity);
                localMap.put(id,provinceEntity);
                JsonNode cityJsonNodes = provinceNode.get("regionEntitys");
                if(cityJsonNodes != null && !cityJsonNodes.isEmpty()){
                    ArrayNode cityNodeArray = (ArrayNode) cityJsonNodes;
                    for(int j = 0;j<cityNodeArray.size();j++){
                        JsonNode cityNode = cityNodeArray.get(j);
                        String cityId = cityNode.get("code").asText();
                        String cityName = cityNode.get("region").asText();
                        LocalEntity cityEntity = new LocalEntity();
                        cityEntity.setId(cityId);
                        cityEntity.setName(cityName);
                        cityEntity.setLevel(2);
                        cityEntity.setPid(id);
                        cityList.add(cityEntity);
                        localMap.put(cityId,cityEntity);
                    }
                }
            }
        }catch (Exception ex){
            ex.printStackTrace();
        }
    }

    public static LocalEntity getById(String id){
        return localMap.getOrDefault(id,null);
    }

    public static List<LocalEntity> getProvinceList(){
        return provinceList;
    }

    public static List<LocalEntity> getCityList(){
        return cityList;
    }

    public static LocalEntity getRandomCity(){
        return cityList.get(ThreadLocalRandom.current().nextInt(cityList.size()));
    }

    public static LocalEntity getRandomProvince() {
        return provinceList.get(ThreadLocalRandom.current().nextInt(provinceList.size()));
    }

    public static void main(String[] args) throws Exception {
        List<SelectedElement> elementList = new ArrayList<>();
        for (LocalEntity localEntity : provinceList) {
            SelectedElement selectedElement = new SelectedElement();
            selectedElement.setId(localEntity.id);
            selectedElement.setName(localEntity.name);
            elementList.add(selectedElement);
        }
        String str1 = SelectedConverter.convert(elementList);
        System.out.println(str1);
        for (LocalEntity localEntity : cityList) {
            SelectedElement selectedElement = new SelectedElement();
            selectedElement.setId(localEntity.id);
            selectedElement.setName(localEntity.name);
            selectedElement.setPid(localEntity.pid);
            elementList.add(selectedElement);
        }
//        String str2 = SelectedConverter.convert(elementList);
//        System.out.println(str2);
    }

    public static class LocalEntity {

        private String id;

        private String name;

        private String pid;

        private int level;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getPid() {
            return pid;
        }

        public void setPid(String pid) {
            this.pid = pid;
        }

        public int getLevel() {
            return level;
        }

        public void setLevel(int level) {
            this.level = level;
        }
    }
}
